from langchain_core.documents import Document
additional_documents = [
    Document(
        page_content="古文化街每天 09:00 - 17:00，免费（购物和小吃额外花费）。",
        metadata={"source": "天津-旅游信息-doc"},
    ),
    Document(
        page_content="意大利风情区全天开放，免费（餐饮和购物额外花费）。",
        metadata={"source": "天津-旅游信息-doc"},
    ),
    Document(
        page_content="天津海河夜景夜间开放，免费（游船费用约100元）。",
        metadata={"source": "天津-旅游信息-doc"},
    ),
    Document(
        page_content="五大道全天开放，免费（骑行和餐饮额外花费）。",
        metadata={"source": "天津-旅游信息-doc"},
    ),
    Document(
        page_content="南市食品街每天 08:00 - 22:00，人均花费50元。",
        metadata={"source": "天津-旅游信息-doc"},
    ),
    Document(
        page_content="天津博物馆周二至周日 09:00 - 16:30（周一闭馆），免费。",
        metadata={"source": "天津-旅游信息-doc"},
    ),
    Document(
        page_content="盘山每天 08:00 - 17:00，人均花费100元。",
        metadata={"source": "天津-旅游信息-doc"},
    ),
    Document(
        page_content="水上公园每天 06:30 - 21:00，免费。",
        metadata={"source": "天津-旅游信息-doc"},
    ),
    Document(
        page_content="黄崖关长城每天 08:00 - 17:00，人均花费65元。",
        metadata={"source": "天津-旅游信息-doc"},
    ),
    Document(
        page_content="天津南开大学全天开放，免费（参观）。",
        metadata={"source": "天津-旅游信息-doc"},
    ),
    Document(
        page_content="天津中山公园每天 06:00 - 21:00，免费。",
        metadata={"source": "天津-旅游信息-doc"},
    ),
    Document(
        page_content="天津市动物园每天 08:30 - 18:00，人均花费40元。",
        metadata={"source": "天津-旅游信息-doc"},
    ),
    Document(
        page_content="天津欢乐谷每天 10:00 -22:00，人均花费220元。",
        metadata={"source": "天津-旅游信息-doc"},
    ),
    Document(
        page_content="天津杨柳青古镇每天 08:00 - 18:00，免费（部分景点收费）。",
        metadata={"source": "天津-旅游信息-doc"},
    ),
    Document(
        page_content="天津瓷房子每天 09:00 - 19:00，人均花费50元。",
        metadata={"source": "天津-旅游信息-doc"},
    ),
    Document(
        page_content="天津水滴体育场根据活动时间开放，人均花费根据活动不同（参观免费）。",
        metadata={"source": "天津-旅游信息-doc"},
    ),
    Document(
        page_content="天津周邓纪念馆每天 09:00 - 16:00（周一闭馆），免费。",
        metadata={"source": "天津-旅游信息-doc"},
    ),
    Document(
        page_content="天津望海楼教堂每天 05:00 - 16:00，免费。",
        metadata={"source": "天津-旅游信息-doc"},
    ),
    Document(
        page_content="天津大悲院每天 09:00 - 16:00，人均花费10元。",
        metadata={"source": "天津-旅游信息-doc"},
    ),
    Document(
        page_content="天津平津战役纪念馆每天 09:00 - 16:30（周一闭馆），免费。",
        metadata={"source": "天津-旅游信息-doc"},
    ),
    Document(
        page_content="天津人民公园每天 07:00 - 22:00，免费。",
        metadata={"source": "天津-旅游信息-doc"},
    ),
    Document(
        page_content="天津音乐厅根据演出时间开放，人均花费根据演出不同。",
        metadata={"source": "天津-旅游信息-doc"},
    ),
    Document(
        page_content="天津滨江道商业街全天开放，免费（购物和餐饮额外花费）。",
        metadata={"source": "天津-旅游信息-doc"},
    ),
    Document(
        page_content="天津津湾广场全天开放，免费（餐饮和娱乐额外花费）。",
        metadata={"source": "天津-旅游信息-doc"},
    ),
]

beijing_documents = [
    Document(
        page_content="故宫博物院每天 08:30 - 17:00（周一闭馆），人均花费60元。",
        metadata={"source": "北京-旅游信息-doc"},
    ),
    Document(
        page_content="天坛公园每天 06:00 - 22:00，人均花费15元。",
        metadata={"source": "北京-旅游信息-doc"},
    ),
    Document(
        page_content="颐和园每天 06:30 - 20:00，人均花费30元。",
        metadata={"source": "北京-旅游信息-doc"},
    ),
    Document(
        page_content="八达岭长城每天 07:30 - 18:00，人均花费40元。",
        metadata={"source": "北京-旅游信息-doc"},
    ),
    Document(
        page_content="鸟巢（国家体育场）每天 10:00 - 18:00，人均花费50元。",
        metadata={"source": "北京-旅游信息-doc"},
    ),
    Document(
        page_content="水立方（国家游泳中心）每天 10:30 - 21:30，人均花费30元。",
        metadata={"source": "北京-旅游信息-doc"},
    ),
    Document(
        page_content="北京动物园每天 07:30 - 19:00，人均花费20元。",
        metadata={"source": "北京-旅游信息-doc"},
    ),
    Document(
        page_content="北海公园每天 06:30 - 20:00，人均花费10元。",
        metadata={"source": "北京-旅游信息-doc"},
    ),
    Document(
        page_content="雍和宫每天 09:00 - 17:00，人均花费25元。",
        metadata={"source": "北京-旅游信息-doc"},
    ),
    Document(
        page_content="圆明园每天 07:00 - 19:00，人均花费10元。",
        metadata={"source": "北京-旅游信息-doc"},
    ),
    Document(
        page_content="景山公园每天 06:00 - 21:00，人均花费2元。",
        metadata={"source": "北京-旅游信息-doc"},
    ),
    Document(
        page_content="中国国家博物馆每天 09:00 - 17:30（周一闭馆），免费。",
        metadata={"source": "北京-旅游信息-doc"},
    ),
    Document(
        page_content="北京欢乐谷每天 09:00 - 22:00，人均花费260元。",
        metadata={"source": "北京-旅游信息-doc"},
    ),
    Document(
        page_content="北京植物园每天 06:30 - 20:00，人均花费10元。",
        metadata={"source": "北京-旅游信息-doc"},
    ),
    Document(
        page_content="北京天文馆每天 09:00 - 16:30（周一闭馆），人均花费10元。",
        metadata={"source": "北京-旅游信息-doc"},
    ),
    Document(
        page_content="香山公园每天 06:00 - 19:30，人均花费10元。",
        metadata={"source": "北京-旅游信息-doc"},
    ),
    Document(
        page_content="恭王府每天 08:00 - 17:00，人均花费40元。",
        metadata={"source": "北京-旅游信息-doc"},
    ),
    Document(
        page_content="北京前门大街全天开放，免费（购物和餐饮额外花费）。",
        metadata={"source": "北京-旅游信息-doc"},
    ),
    Document(
        page_content="南锣鼓巷全天开放，免费（购物和餐饮额外花费）。",
        metadata={"source": "北京-旅游信息-doc"},
    ),
    Document(
        page_content="798艺术区全天开放，免费（展览和餐饮额外花费）。",
        metadata={"source": "北京-旅游信息-doc"},
    ),
]

province_dict = {
    "ATJ": ["天津"],
    "ABJ": ["北京"],
    "ASH": ["上海"],
    "ACQ": ["重庆"],
    "AXG": ["香港"],
    "AAM": ["澳门"],
    "ATW": [
        "台北", "新北", "桃园", "台中", "台南", "高雄", "基隆", "新竹", "嘉义",
        "苗栗", "彰化", "南投", "云林", "屏东", "宜兰", "花莲", "台东", "澎湖", "金门", "连江"
    ],
    "AHE": ["石家庄", "唐山", "秦皇岛", "邯郸", "邢台", "保定", "张家口", "承德", "沧州", "廊坊", "衡水"],
    "ASX": ["太原", "大同", "阳泉", "长治", "晋城", "朔州", "晋中", "运城", "忻州", "临汾", "吕梁","新疆"],
    "ALN": ["沈阳", "大连", "鞍山", "抚顺", "本溪", "丹东", "锦州", "营口", "阜新", "辽阳", "盘锦", "铁岭", "朝阳", "葫芦岛"],
    "AJL": ["长春", "吉林", "四平", "辽源", "通化", "白山", "松原", "白城", "延边"],
    "AHL": ["哈尔滨", "齐齐哈尔", "鸡西", "鹤岗", "双鸭山", "大庆", "伊春", "佳木斯", "七台河", "牡丹江", "黑河", "绥化", "大兴安岭"],
    "AJS": ["南京", "无锡", "徐州", "常州", "苏州", "南通", "连云港", "淮安", "盐城", "扬州", "镇江", "泰州", "宿迁"],
    "AZJ": ["杭州", "宁波", "温州", "嘉兴", "湖州", "绍兴", "金华", "衢州", "舟山", "台州", "丽水"],
    "AAH": ["合肥", "芜湖", "蚌埠", "淮南", "马鞍山", "淮北", "铜陵", "安庆", "黄山", "滁州", "阜阳", "宿州", "六安", "亳州", "池州", "宣城"],
    "AFJ": ["福州", "厦门", "莆田", "三明", "泉州", "漳州", "南平", "龙岩", "宁德"],
    "AJX": ["南昌", "景德镇", "萍乡", "九江", "新余", "鹰潭", "赣州", "吉安", "宜春", "抚州", "上饶"],
    "ASD": ["济南", "青岛", "淄博", "枣庄", "东营", "烟台", "潍坊", "济宁", "泰安", "威海", "日照", "临沂", "德州", "聊城", "滨州", "菏泽"],
    "AHA": ["郑州", "开封", "洛阳", "平顶山", "安阳", "鹤壁", "新乡", "焦作", "濮阳", "许昌", "漯河", "三门峡", "南阳", "商丘", "信阳", "周口", "驻马店", "济源"],
    "AHB": ["武汉", "黄石", "十堰", "宜昌", "襄阳", "鄂州", "荆门", "孝感", "荆州", "黄冈", "咸宁", "随州", "恩施", "仙桃", "潜江", "天门", "神农架"],
    "AHN": ["长沙", "株洲", "湘潭", "衡阳", "邵阳", "岳阳", "常德", "张家界", "益阳", "郴州", "永州", "怀化", "娄底", "湘西"],
    "AGD": ["广州", "韶关", "深圳", "珠海", "汕头", "佛山", "江门", "湛江", "茂名", "肇庆", "惠州", "梅州", "汕尾", "河源", "阳江", "清远", "东莞", "中山", "潮州", "揭阳", "云浮"],
    "AHI": ["海口", "三亚", "三沙", "儋州"],
    "ASC": ["成都", "自贡", "攀枝花", "泸州", "德阳", "绵阳", "广元", "遂宁", "内江", "乐山", "南充", "眉山", "宜宾", "广安", "达州", "雅安", "巴中", "资阳", "阿坝", "甘孜", "凉山"],
    "AGZ": ["贵阳", "六盘水", "遵义", "安顺", "毕节", "铜仁", "黔西南", "黔东南", "黔南"],
    "AYN": ["昆明", "曲靖", "玉溪", "保山", "昭通", "丽江", "普洱", "临沧", "楚雄", "红河", "文山", "西双版纳", "大理", "德宏", "怒江", "迪庆"],
    "ASN": ["西安", "铜川", "宝鸡", "咸阳", "渭南", "延安", "汉中", "榆林", "安康", "商洛"],
    "AGS": ["兰州", "嘉峪关", "金昌", "白银", "天水", "武威", "张掖", "平凉", "酒泉", "庆阳", "定西", "陇南", "临夏", "甘南"],
    "AQH": ["西宁", "海东", "海北", "黄南", "海南", "果洛", "玉树", "海西"],
    "ANM": ["呼和浩特", "包头", "乌海", "赤峰", "通辽", "鄂尔多斯", "呼伦贝尔", "巴彦淖尔", "乌兰察布", "兴安盟", "锡林郭勒盟", "阿拉善盟"],
    "AGX": ["南宁", "柳州", "桂林", "梧州", "北海", "防城港", "钦州", "贵港", "玉林", "百色", "贺州", "河池", "来宾", "崇左"],
    "AXZ": ["拉萨", "日喀则", "昌都", "林芝", "山南", "那曲", "阿里"],
    "ANX": ["银川", "石嘴山", "吴忠", "固原", "中卫"],
    "AXJ": ["乌鲁木齐", "克拉玛依", "吐鲁番", "哈密", "昌吉", "博尔塔拉", "巴音郭楞", "阿克苏", "克孜勒苏柯尔克孜", "喀什", "和田", "伊犁哈萨克", "塔城", "阿勒泰", "石河子", "阿拉尔", "图木舒克", "五家渠", "铁门关"]
}

locations = [
                "天津", "北京", "上海", "重庆", "澳门","香港",
                "台北", "新北", "桃园", "台中", "台南", "高雄", "基隆", "嘉义",
                "新竹", "苗栗", "彰化", "南投", "云林", "屏东", "宜兰", "花莲", "台东", "澎湖", "金门", "连江",
                "石家庄", "唐山", "秦皇岛", "邯郸", "邢台", "保定", "张家口", "承德", "沧州", "廊坊", "衡水",
                "太原", "大同", "阳泉", "长治", "晋城", "朔州", "晋中", "运城", "忻州", "临汾", "吕梁",
                "沈阳", "大连", "鞍山", "抚顺", "本溪", "丹东", "锦州", "营口", "阜新", "辽阳", "盘锦", "铁岭", "朝阳", "葫芦岛",
                "长春", "吉林", "四平", "辽源", "通化", "白山", "松原", "白城", "延边",
                "哈尔滨", "齐齐哈尔", "鸡西", "鹤岗", "双鸭山", "大庆", "伊春", "佳木斯", "七台河", "牡丹江", "黑河", "绥化", "大兴安岭",
                "南京", "无锡", "徐州", "常州", "苏州", "南通", "连云港", "淮安", "盐城", "扬州", "镇江", "泰州", "宿迁",
                "杭州", "宁波", "温州", "嘉兴", "湖州", "绍兴", "金华", "衢州", "舟山", "台州", "丽水",
                "合肥", "芜湖", "蚌埠", "淮南", "马鞍山", "淮北", "铜陵", "安庆", "黄山", "滁州", "阜阳", "宿州", "六安", "亳州", "池州", "宣城",
                "福州", "厦门", "莆田", "三明", "泉州", "漳州", "南平", "龙岩", "宁德",
                "南昌", "景德镇", "萍乡", "九江", "新余", "鹰潭", "赣州", "吉安", "宜春", "抚州", "上饶",
                "济南", "青岛", "淄博", "枣庄", "东营", "烟台", "潍坊", "济宁", "泰安", "威海", "日照", "临沂", "德州", "聊城", "滨州", "菏泽",
                "郑州", "开封", "洛阳", "平顶山", "安阳", "鹤壁", "新乡", "焦作", "濮阳", "许昌", "漯河", "三门峡", "南阳", "商丘", "信阳", "周口", "驻马店", "济源",
                "武汉", "黄石", "十堰", "宜昌", "襄阳", "鄂州", "荆门", "孝感", "荆州", "黄冈", "咸宁", "随州", "恩施", "仙桃", "潜江", "天门", "神农架",
                "长沙", "株洲", "湘潭", "衡阳", "邵阳", "岳阳", "常德", "张家界", "益阳", "郴州", "永州", "怀化", "娄底", "湘西",
                "广州", "韶关", "深圳", "珠海", "汕头", "佛山", "江门", "湛江", "茂名", "肇庆", "惠州", "梅州", "汕尾", "河源", "阳江", "清远", "东莞", "中山", "潮州", "揭阳", "云浮",
                "海口", "三亚", "三沙", "儋州",
                "成都", "自贡", "攀枝花", "泸州", "德阳", "绵阳", "广元", "遂宁", "内江", "乐山", "南充", "眉山", "宜宾", "广安", "达州", "雅安", "巴中", "资阳", "阿坝", "甘孜", "凉山",
                "贵阳", "六盘水", "遵义", "安顺", "毕节", "铜仁", "黔西南", "黔东南", "黔南",
                "昆明", "曲靖", "玉溪", "保山", "昭通", "丽江", "普洱", "临沧", "楚雄", "红河", "文山", "西双版纳", "大理", "德宏", "怒江", "迪庆",
                "西安", "铜川", "宝鸡", "咸阳", "渭南", "延安", "汉中", "榆林", "安康", "商洛",
                "兰州", "嘉峪关", "金昌", "白银", "天水", "武威", "张掖", "平凉", "酒泉", "庆阳", "定西", "陇南", "临夏", "甘南",
                "西宁", "海东", "海北", "黄南", "海南", "果洛", "玉树", "海西",
                "呼和浩特", "包头", "乌海", "赤峰", "通辽", "鄂尔多斯", "呼伦贝尔", "巴彦淖尔", "乌兰察布", "兴安盟", "锡林郭勒盟", "阿拉善盟",
                "南宁", "柳州", "桂林", "梧州", "北海", "防城港", "钦州", "贵港", "玉林", "百色", "贺州", "河池", "来宾", "崇左",
                "拉萨", "日喀则", "昌都", "林芝", "山南", "那曲", "阿里",
                "银川", "石嘴山", "吴忠", "固原", "中卫",
                "乌鲁木齐", "克拉玛依", "吐鲁番", "哈密", "昌吉", "博尔塔拉", "巴音郭楞", "阿克苏", "克孜勒苏柯尔克孜", "喀什", "和田", "伊犁哈萨克", "塔城", "阿勒泰", "石河子", "阿拉尔", "图木舒克", "五家渠", "铁门关"]
